tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# CLI tools
brew "git"
brew "neovim"
brew "ack"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tealdeer"
brew "exa"
brew "ripgrep"
brew "tmux" # Necessary for overmind
brew "overmind"

# Fonts
cask "font-fira-mono"
brew "svn" # Necessary for roboto
cask "font-roboto"
cask "font-jetbrains-mono"

# Apps
cask "iterm2"
cask "1password"
cask "telegram"
cask "spotify"
cask "rectangle"
cask "clocker"
cask "obsidian"

cask "google-chrome"
cask "firefox"

cask "visual-studio-code"
cask "docker"
cask "dash"
cask "postman"

cask "daisydisk"
cask "bartender"
cask "istat-menus"
cask "raycast"

cask "slack"
cask "zoom"
cask "figma"
