# CLI tools
brew "git"
brew "neovim"
brew "ack"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tealdeer"
brew "eza"
brew "ripgrep"
brew "tmux" # Necessary for overmind
brew "overmind"
brew "hyperfine"
brew "fzf"
brew "htop"
brew "xh"
brew "jq"
brew "powerlevel10k"

# Fonts
# cask "font-monaspace" # Not installed because it's not the nerdfonts version

# Apps
cask "raycast"
cask "google-chrome"
cask "1password"
cask "ghostty"
cask "slack"
cask "mise"
cask "visual-studio-code"
cask "obsidian"
cask "docker"
cask "todoist"

cask "zoxide"
cask "figma"
cask "mos"
cask "spotify"
cask "rectangle"
cask "clocker"
cask "istat-menus"
cask "postman"
cask "daisydisk"
cask "bartender"
