tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# CLI tools
brew "git"
brew "ack"
brew "zsh"
brew "zsh-completions"
brew "tealdeer"
brew "exa"
brew "ripgrep"
brew "tmux" # Necessary for overmind
brew "overmind"
brew "hyperfine"
brew "fzf"
brew "htop"
brew "xh"
brew "jq"
brew "romkatv/powerlevel10k/powerlevel10k"

# Fonts
cask "font-fira-code"

# Apps
cask "iterm2"
cask "1password"
cask "spotify"
cask "rectangle"
cask "clocker"
cask "obsidian"
cask "todoist"
cask "mos"

cask "google-chrome"
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "daisydisk"
cask "raycast"
cask "slack"
